---
kind: other
id: Properties.T:Autodesk.Revit.DB.Profile
source: html/78be9812-2b61-bafe-2f2a-485025b17beb.htm
---
# Profile Properties

Retrieve the curves that make up the boundary of the profile.